          Минутка генетики
На вход программе подается строка генетического кода, состоящая из букв А (аденин), Г (гуанин), Ц (цитозин), Т (тимин). Напишите программу, которая подсчитывает сколько аденина, гуанина, цитозина и тимина входит в данную строку генетического кода.    




# put your python code here
n = input().lower()
count_a = 0
count_g = 0
count_c = 0
count_t = 0
for i in range(len(n)):
    if n[i] == 'а':
        count_a += 1
    elif n[i] == 'г':
        count_g += 1
    elif n[i] == 'ц':
        count_c += 1
    elif n[i] == 'т':
        count_t += 1
print('Аденин:', count_a)
print('Гуанин:', count_g)
print('Цитозин:', count_c)
print('Тимин:', count_t)


Исходные данные ровняем по любому из регистров, верхний или нижний, кому как.
Заводим четыре счётчика на каждый элемент.
Потом циклом перебираем каждый элемент строки. Если соответствует условию, добавляем к счётчику.
